processes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-25 Wed 22:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Процессы в Linux</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pavel Vavilin" />
<meta name="keywords" content="Linux" />
<link rel="stylesheet" type="text/css" href="solarized-dark.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://pimiento.github.io/"> UP </a>
 |
 <a accesskey="H" href="https://pimiento.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">Процессы в Linux</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org373e490">1. Процесс</a>
<ul>
<li><a href="#orge8fa50c">1.1. Атрибуты процессов</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org373e490" class="outline-2">
<h2 id="org373e490"><span class="section-number-2">1</span> Процесс</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
Обычно программой называют совокупность файлов, будь то набор исходных текстов, объектных фалов или собственно исполняемый файл. Для того чтобы программа могла быть запущена на выполнение, операционная система сначала должна создать окружение или среду выполнения задачи, куда относятся ресурсы памяти, возможность доступа к устройствам ввода/вывода и различным системным ресурсам, включая услуги ядра.
</p>
</blockquote>

<ul class="org-ul">
<li>Процесс является тлько <i>«мёртвой»</i> статической оболочкой, хранящей учётные данные и обеспечивающей окружение динамического исполнения потока, даже если это единственный (главный) исполняемый поток приложения (процесса), как это принято в терминологии, не имеющей отношения к потоковым понятиям.</li>
<li>Любые взаимодействия, синхронизация, диспетчирезация и другие механизмы имеют смысл только применительно к потокам, даже если это потоки, локализованные в рамках различных процессов.
Здесь возникает термин <b>IPC</b> — средство взаимодействия <span class="underline">процессов</span>. Для однопотоковых приложений этот терминологический нюанс не вносит ровно никакого различия, но при переходе к многопотоковым приложениям мы должны рассуждать в терминах именно взаимодействующих потоков, локализованных внутри процессов (одного или различных)</li>
<li>В системах с аппаратной трансляцией адресов памяти (MMU — Memory Management Unit) процесс создаёт для своих потоков дополнительные <i>«границы существования»</i> — защищённое адресное пространство. Большинство сложностей, описываемых в литературе в связи с использованием <b>IPC</b>, обусловлено необходимостью взаимодействующих потоков преодолевать адресные барьеры, устанавливаемые процессами для каждого из них.</li>
</ul>
</div>

<div id="outline-container-orge8fa50c" class="outline-3">
<h3 id="orge8fa50c"><span class="section-number-3">1.1</span> Атрибуты процессов</h3>
<div class="outline-text-3" id="text-1-1">
<dl class="org-dl">
<dt>PID</dt><dd>идентификатор процесса, присваиваемый процессу при создании, например вызовом <i>fork()</i>. <b>PID</b> позволяет системе однозначно идентифицировать каждый процесс. При создании процесса ему присваивается первый свободный идентификатор. Присвоение происходит по возрастающей до тех пор пока не кончатся доступные значения <b>PID</b>. Тогда следующий процесс получает минимальный свободный <b>PID</b>, и весь цикл повторяется снова. Процесс, загружавший ОС, является родительским для всех процессов в системе и его <b>PID</b> = 1, обычно называется <i>init</i>, запускается ядром ОС по окончании процедуры <i>bootstrap</i>. Процесс с <b>PID</b> = 0 это обычно процесс <i>scheduler</i> также называемый <i>swapper</i>. Процесс <i>init</i> никогда не умирает в процессе работы ОС. Это обычный пользовательский процесс (в отличие от процесса <i>swapper</i>, работающего в ядре), хотя и запущен с привелегиями суперпользователя.</dd>
</dl>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #00ffff;">pid_t</span> <span style="color: #ffffff;">p</span> = getpid();
printf(<span style="color: #ffa500;">"current pid: %zu"</span>, p);
</pre>
</div>

<pre class="example">
current pid: 25401

</pre>

<dl class="org-dl">
<dt>PPID</dt><dd><b>PID</b> процесса, породившего данный процесс.</dd>
</dl>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #00ffff;">pid_t</span> <span style="color: #ffffff;">pp</span> = getppid();
printf(<span style="color: #ffa500;">"current ppid: %zu"</span>, pp);
</pre>
</div>

<pre class="example">
current ppid: 10153

</pre>

<dl class="org-dl">
<dt>TTY</dt><dd>терминальная линия: терминал или псевдотерминал, ассоциированный с процессом. Если процесс становится процессом-демоном, то он отсоединяется от своей терминальной линии и не имеет ассоциированной терминальной линии.</dd>
<dt>RID</dt><dd>реальный индентификатор пользователя.</dd>
</dl>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #00ffff;">uid_t</span> <span style="color: #ffffff;">u</span> = getuid();
printf(<span style="color: #ffa500;">"current uid: %zu"</span>, u);
</pre>
</div>

<pre class="example">
current uid: 1000

</pre>

<dl class="org-dl">
<dt>EUID</dt><dd>эффективный идентификатор пользователя. Эффективный идентификатор служит для определения прав доступа процесса к системным ресурсам. Обычно <b>RID</b> и <b>EUID</b> совпадают, но установка <b>SUID</b> флага для исполняемого файла процесса позволяет расширить полномочия процесса.</dd>
</dl>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #00ffff;">uid_t</span> <span style="color: #ffffff;">eu</span> = geteuid();
printf(<span style="color: #ffa500;">"current effective uid: %zu"</span>, eu);
</pre>
</div>

<pre class="example">
current effective uid: 1000

</pre>

<dl class="org-dl">
<dt>RGID</dt><dd>реальный идентификатор группы.</dd>
</dl>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #00ffff;">gid_t</span> <span style="color: #ffffff;">g</span> = getgid();
printf(<span style="color: #ffa500;">"current gid: %zu"</span>, g);
</pre>
</div>

<pre class="example">
current gid: 1000

</pre>

<dl class="org-dl">
<dt>EGID</dt><dd>эффективный идентификатор группы. <b>EGID</b> не совпадает с <b>RGID</b> в случае когда установлен флаг <b>SGID</b>.</dd>
</dl>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #00ffff;">gid_t</span> <span style="color: #ffffff;">eg</span> = getegid();
printf(<span style="color: #ffa500;">"current effective gid: %zu"</span>, eg);
</pre>
</div>

<pre class="example">
current effective gid: 1000

</pre>

<p>
Часто в качестве атрибутов процесса называют и приоритет выполнения. Однако приоритет является атрибутом не процесса, а потока, но если поток единственный (главный, порождённый функцией <i>main()</i>), его приоритет и есть то, что понимается под <i>«приоритетом процесса»</i>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pavel Vavilin</p>
<p class="date">Created: 2017-10-25 Wed 22:09</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
